In [3]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

#import data file
df = pd.read_csv("Data/Export/student_core_grades.csv")

#drop instances without a math, english, and science class
#df = df.dropna(subset=(['math9', 'math10', 'eng9', 'eng10', 'bio9', 'phys10']))

#show first few rows
df.head()

,ID,math9,math9_score,math10,math10_score,eng9,eng9_score,eng10,eng10_score,hist9,...,ELL_Status,Double_Math,FRPL_Status,Grade_Level,Home_Language,Date_of_Birth,Race_Ethnicity,Transfer_Student,Special_Education_Status,schoolName
0,2241046.0,Algebra 1,80.0,Geometry,71.329998,Eng 1,85.000000,English 2,89.200001,World Civ 2,...,False,0.0,2.0,11.0,0.0,8/3/2006,3.0,False,False,0.0
1,2241076.0,Alg 1,50.0,NaN,NaN,Eng 1,58.333333,Eng 1,75.000000,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,4230947.0,Alg 1,70.0,Geometry Bi,70.800003,Eng 1,70.000000,NaN,NaN,NaN,...,True,0.0,3.0,11.0,0.0,11/27/2006,3.0,False,False,0.0
3,4241041.0,ALG 1,65.0,GEOM,75.000000,ENG 1,57.500000,ENG 2,75.000000,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,4241058.0,ALG 1,75.0,GEOM,85.000000,ENG 1,80.000000,ENG 2,85.000000,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
#df.columns
df_no_courses = df.drop(columns = ['math9','math10', 'eng9', 'eng10', 'hist9', 'bio9', 'phys10' ])
df_no_courses.head()

,ID,math9_score,math10_score,eng9_score,eng10_score,hist9_score,bio_score,phys10_score,chem11,chem11_score,...,ELL_Status,Double_Math,FRPL_Status,Grade_Level,Home_Language,Date_of_Birth,Race_Ethnicity,Transfer_Student,Special_Education_Status,schoolName
0,2241046.0,80.0,71.329998,85.000000,89.200001,85.0,80.0,83.375,NaN,NaN,...,False,0.0,2.0,11.0,0.0,8/3/2006,3.0,False,False,0.0
1,2241076.0,50.0,NaN,58.333333,75.000000,NaN,50.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,4230947.0,70.0,70.800003,70.000000,NaN,NaN,NaN,NaN,NaN,NaN,...,True,0.0,3.0,11.0,0.0,11/27/2006,3.0,False,False,0.0
3,4241041.0,65.0,75.000000,57.500000,75.000000,NaN,75.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,4241058.0,75.0,85.000000,80.000000,85.000000,NaN,50.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN